src/toir_cfe/src/Reports/торо_ПлановыеВнеплановыеРемонты/торо_ПлановыеВнеплановыеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3c61c94d-6f97-43b7-83fe-e250d64c6842">
  <name>торо_ПлановыеВнеплановыеРемонты</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

src/toir_cfe/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09bf821b-96d8-44ff-a873-1aa963572a34">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="72058171-1407-4dd6-aab0-0f72afd60d2a">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="168c85e9-3bb0-431a-ae6e-08c455b37fa5">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9f5d4e4f-bee5-4929-ac3d-e4200cf1416f">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6306ae3-4e8a-4225-8afa-a01e16f34954">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="85c92d14-1c04-44bd-9284-befe63c7394c">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="605b0bf5-59d2-473b-b6f9-85ceca4cd110">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4a69a70d-1b4c-4999-a3dd-ae1deb331fea">
  <name>ДанныеПроизводственногоКалендаря</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="563c0f5c-e0b4-4229-a3f6-183091060aa4">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="71909b36-38e5-4d41-9803-7860ed2b377d">
  <name>торо_ПланГрафикРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="7e9515d4-1e0b-402a-8a9b-c6a04c349bc7">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="caabbdda-e895-4d1f-939f-3da6bbc4ef8a">
    <name>ПланРемонтов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="33a739f5-f146-4490-87df-57785546d548">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="5761f0bd-211f-4da4-82fc-476910d2db04">
    <name>проф_НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="757bfdf7-b0f2-4ce9-bf65-9a73743034b9">
    <name>проф_ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="27d1aabe-5590-4b8a-92b6-17540e81adc7">
    <name>проф_ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ee9e378e-a344-4a59-a2a5-054789005c8d">
    <name>проф_ТабличноеПолеРемонтныеЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f450d93a-cf39-4570-a8cc-896795681912">
    <name>проф_РемЦиклыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e01b6f5d-fe35-434f-87a5-1ce36557d3e2">
    <name>проф_ТабЗапчастейОбъектовРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0bdcaf87-2304-461b-9957-e534bec7fb10">
    <name>проф_ТабЗатратПоВидамРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c30740dc-2210-44f4-be97-a6f7b8e216b1">
    <name>проф_ГарантииОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/Reports/торо_ПлановыеВнеплановыеРемонты/Forms/проф_ФормаОтборовДляПФ/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

//++ Проф-ИТ, #83, Иванова Е.С., 25.09.2023

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяПечатнойФормы") Тогда
		ИмяКомандыПФ = Параметры.ИмяПечатнойФормы;
	КонецЕсли;
	
	Если Параметры.Свойство("ПериодОтчета") Тогда
		ПериодОтчета = Параметры.ПериодОтчета;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяКомандыПФ) 
	И ИмяКомандыПФ = "ИД_ГодовойПланГрафикРемонта" Тогда
		Элементы.ВидРемонта.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ИмяКомандыПФ  = "ИД_ГодовойПланГрафикРемонта" Тогда 
		
		Идентификатор = "ИД_ГодовойПланГрафикРемонта";
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
		ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
		ОписаниеПечатнойФормы.ТабличныйДокумент = проф_ПечатьГодовойГрафикППРиТО_Сервер(ПериодОтчета);
		
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, , ЭтаФорма);
	КонецЕсли;
	
	Если ИмяКомандыПФ =  "ИД_МесячныйПланГрафикРемонта" Тогда
		
		Идентификатор = "ИД_МесячныйПланГрафикРемонта";
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
		ОписаниеПечатнойФормы = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
		ОписаниеПечатнойФормы.ТабличныйДокумент = проф_ПечатьМесячныйГрафикППРиТО_Сервер(ПериодОтчета);
		
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, , ЭтаФорма);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

//-- Проф-ИТ, #83, Иванова Е.С., 25.09.2023

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #83, Иванова Е.С., 25.09.2023

// Проверяет Имя, КлючВарианта отчета и его период
// Добавляет команду на форму для необходимого отчета
&НаСервере
Функция проф_ПечатьГодовойГрафикППРиТО_Сервер(ПериодОтчета)

	ТабДок = Новый ТабличныйДокумент;
    ТабДок.КлючПараметровПечати = "ПараметрыПечати_ГодовойПланГрафикРемонта";
    ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр = Истина;

	Макет = Отчеты.торо_ПлановыеВнеплановыеРемонты.ПолучитьМакет("проф_ПФ_MXL_ГодовойГрафикППРиТО"); 
    
    Запрос = Новый Запрос; 
    Запрос.УстановитьПараметр("ДатаНач", ПериодОтчета.ДатаНачала);
    Запрос.УстановитьПараметр("ДатаКон", ПериодОтчета.ДатаОкончания);
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Запрос.УстановитьПараметр("ОбъектРемонтныхРабот", ОбъектРемонта);
	КонецЕсли;
    Запрос.Текст = ПолучитьТекстЗапросаГодовойГрафикППРиТО();
    Результат = Запрос.ВыполнитьПакет();
    
    ВыборкаДляОбластиШапкаТаблицы = Результат[Результат.ВГраница() - 1].Выбрать();	
    ВыборкаОбъектыРемонта = Результат[Результат.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
    
    ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка"); 
    Дата = ПериодОтчета.ДатаНачала;
    ОбластьШапка.Параметры.текДата = Формат(ТекущаяДатаСеанса(), "ДФ='« дд » ММММ гггг ""г.""'");
    ОбластьШапка.Параметры.год = Формат(Дата, "ДФ=гггг");
    ТабДок.Вывести(ОбластьШапка);
    
    МассивОбластейДляПроверки = Новый Массив;
    Область = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
    ТабДок.Вывести(Область);
    НомерЯчейки = 4;
    
    Пока ВыборкаДляОбластиШапкаТаблицы.Следующий() Цикл
    	ОбластьДопКолонки = Макет.ПолучитьОбласть("ОбластьДопКолонкиШапки");
    	ОбластьДопКолонки.Параметры.год = Формат(Дата, "ДФ=гггг");
    	ОбластьДопКолонки.Параметры.ВидРемонта = ВыборкаДляОбластиШапкаТаблицы.ВидРемонтныхРабот;
    	ОбластьДопКолонки.Параметры.НомерКолонки = НомерЯчейки;
    	НомерЯчейки = НомерЯчейки + 1;
    	ТабДок.Присоединить(ОбластьДопКолонки);
    КонецЦикла;
    
    МассивОбластейДляПроверки.Добавить(Область);
	

    Пока ВыборкаОбъектыРемонта.Следующий() Цикл
    	ОбластьТЧ = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы");
    	МассивОбластейДляПроверки.Добавить(ОбластьТЧ);
    	ОбластьТЧ.Параметры.Заполнить(ВыборкаОбъектыРемонта);
    	ТабДок.Вывести(ОбластьТЧ);
    	Выборка = ВыборкаОбъектыРемонта.Выбрать();
		Пока Выборка.Следующий() Цикл
    		ОбластьДопКолонки = Макет.ПолучитьОбласть("ОбластьДопКолонкиСтроки");
    		ОбластьДопКолонки.Параметры.Количество = Выборка.Количество;
    		ТабДок.Присоединить(ОбластьДопКолонки);
    	КонецЦикла;
    	
    КонецЦикла;	
    
    ОбъединитьЯчейкиВТабличномДокументе(ТабДок, "#");
 
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция проф_ПечатьМесячныйГрафикППРиТО_Сервер(ПериодОтчета)

	ТабДок = Новый ТабличныйДокумент;
    ТабДок.КлючПараметровПечати = "ПараметрыПечати_МесячныйПланГрафикРемонта";
    ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр = Истина;

	Макет = Отчеты.торо_ПлановыеВнеплановыеРемонты.ПолучитьМакет("проф_ПФ_MXL_МесячныйГрафикППРиТО"); 
    
    Запрос = Новый Запрос; 
    Запрос.УстановитьПараметр("ДатаНач", ПериодОтчета.ДатаНачала);
    Запрос.УстановитьПараметр("ДатаКон", ПериодОтчета.ДатаОкончания);
   	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Запрос.УстановитьПараметр("ОбъектРемонтныхРабот", ОбъектРемонта);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидРемонта) Тогда
		Запрос.УстановитьПараметр("ВидРемонтныхРабот", ВидРемонта);
	КонецЕсли;

    Запрос.Текст = ПолучитьТекстЗапросаМесячныйГрафикППРиТО();
    Результат = Запрос.ВыполнитьПакет();
    
    ВыборкаДляОбластиШапкаТаблицы = Результат[Результат.ВГраница() - 1].Выбрать();	
    ВыборкаОбъектыРемонта = Результат[Результат.ВГраница()].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
    
    ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка"); 
    Дата = ПериодОтчета.ДатаНачала;
    ОбластьШапка.Параметры.текДата = Формат(ТекущаяДатаСеанса(), "ДФ='« дд » ММММ гггг ""г.""'");
	ОбластьШапка.Параметры.год = Формат(Дата, "ДФ=гггг");
    ОбластьШапка.Параметры.месяц = Формат(Дата, "ДФ=ММММ");
    ТабДок.Вывести(ОбластьШапка);
    	
	ДобавитьШапкуТаблицы(ТабДок, Макет, ВыборкаДляОбластиШапкаТаблицы);
	
	Пока ВыборкаОбъектыРемонта.Следующий() Цикл
    	ОбластьТЧ = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы");
    	ОбластьТЧ.Параметры.Заполнить(ВыборкаОбъектыРемонта);
    	ТабДок.Вывести(ОбластьТЧ);
		Выборка = ВыборкаОбъектыРемонта.Выбрать();
		Пока Выборка.Следующий() Цикл
    		ОбластьДопКолонки = Макет.ПолучитьОбласть("ОбластьДопКолонкиСтроки");
    		ОбластьДопКолонки.Параметры.ВидРемонта = Выборка.ВидРемонтныхРабот;
    		ТабДок.Присоединить(ОбластьДопКолонки);
    	КонецЦикла;

		Если Не ТабДок.ПроверитьВывод(ОбластьТЧ) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ДобавитьШапкуТаблицы(ТабДок, Макет, ВыборкаДляОбластиШапкаТаблицы);
		КонецЕсли;	
    	    	
	КонецЦикла;
	
    ОбъединитьЯчейкиВТабличномДокументе(ТабДок, "#");
	
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьШапкуТаблицы(ТабличныйДокумент, Макет, ВыборкаДляОбластиШапкаТаблицы)
	
    Область = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
    ТабличныйДокумент.Вывести(Область);
	
	Пока ВыборкаДляОбластиШапкаТаблицы.Следующий() Цикл
    	ОбластьДопКолонки = Макет.ПолучитьОбласть("ОбластьДопКолонкиШапки");
    	ОбластьДопКолонки.Параметры.ЧислоМесяца = Формат(ВыборкаДляОбластиШапкаТаблицы.Дата, "ДФ=дд");
    	ТабличныйДокумент.Присоединить(ОбластьДопКолонки);
    КонецЦикла;
    	
	ВыборкаДляОбластиШапкаТаблицы.Сбросить();
	
КонецПроцедуры

// Процедура - Объединить ячейки в табличном документе
// Находит ячейки, содержащие в тексте МаркерОбъединения
// Объединяет ячейки, располагающиеся рядом, содержащие одинаковый текст и маркер объединения
//
// Параметры:
//  ТабличныйДокумент	 - ТабличныйДокумент
//  МаркерОбъединения	 - Строка
//
&НаСервереБезКонтекста
Процедура ОбъединитьЯчейкиВТабличномДокументе(ТабличныйДокумент, МаркерОбъединения) Экспорт
	
	ОбъединяемыеЯчейки = НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, МаркерОбъединения);
	ОбъединяемыеЯчейки.Колонки.Добавить("Диапазон");
	ОбъединяемыеЯчейки.Сортировать("Верх, Лево");
	
	Для Каждого Строка из ОбъединяемыеЯчейки Цикл
		Отбор = Новый Структура("Текст, Верх, Лево", Строка.Текст, Строка.Верх - 1, Строка.Лево);
		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
			Строка.Диапазон.Низ = Макс(Строка.Диапазон.Низ, Строка.Верх);
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх, Строка.Лево - 1);
		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() Тогда
			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
			Строка.Диапазон.Право = Макс(Строка.Диапазон.Право, Строка.Лево);
			Продолжить;
		КонецЕсли;
		
		СтруктураДиапазон = Новый Структура("Текст, Верх, Лево, Низ, Право");
		ЗаполнитьЗначенияСвойств(СтруктураДиапазон, Строка);
		СтруктураДиапазон.Низ = Строка.Верх;
        СтруктураДиапазон.Право = Строка.Лево;
		
		Строка.Диапазон = СтруктураДиапазон;
	КонецЦикла;
	
	ОбъединяемыеЯчейки.Свернуть("Диапазон");
	Для Каждого Строка Из ОбъединяемыеЯчейки Цикл
		Диапазон = Строка.Диапазон;
		Область = ТабличныйДокумент.Область(Диапазон.Верх, Диапазон.Лево, Диапазон.Низ, Диапазон.Право);
		Область.Объединить();
		
		// Удалим маркер объединения из текст ячейки
		Область.Текст = СтрЗаменить(Область.Текст, МаркерОбъединения, "");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, ПодстрокаПоиска) Экспорт
	
	НайденныеОбласти = Новый ТаблицаЗначений;
	НайденныеОбласти.Колонки.Добавить("Область");
	НайденныеОбласти.Колонки.Добавить("Текст");
	НайденныеОбласти.Колонки.Добавить("Верх");
	НайденныеОбласти.Колонки.Добавить("Лево");
	
	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);
	
	Пока НЕ НайденнаяОбласть = Неопределено Цикл
		
		НоваяСтрока = НайденныеОбласти.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяОбласть);
		НоваяСтрока.Область = НайденнаяОбласть;
		
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
		
	КонецЦикла;
	
	Возврат НайденныеОбласти;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаГодовойГрафикППРиТО()

	Текст = "ВЫБРАТЬ
	        |	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	        |	торо_ПланГрафикРемонта.ID КАК ID,
	        |	торо_ПланГрафикРемонта.Регистратор КАК Регистратор,
	        |	торо_ПланГрафикРемонта.Период КАК Период
	        |ПОМЕСТИТЬ ВТ_ПлановыеРемонты
	        |ИЗ
	        |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПланГрафикРемонта
	        |ГДЕ
	        |	торо_ПланГрафикРемонта.Отменен = ЛОЖЬ
	        |	И торо_ПланГрафикРемонта.Замещен = ЛОЖЬ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	        |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	        |	КОЛИЧЕСТВО(торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот) КАК Количество
	        |ПОМЕСТИТЬ ВТ_ПлановыеРаботыСКоличеством
	        |ИЗ
	        |	ВТ_ПлановыеРемонты КАК ВТ_ПлановыеРемонты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	        |			ПО (торо_АктуальныеПлановыеДатыРемонтов.IDРемонта = торо_ПланГрафикРемонтаПланРемонтов.ID)
	        |		ПО ВТ_ПлановыеРемонты.Регистратор = торо_ПланГрафикРемонтаПланРемонтов.Ссылка
	        |			И ВТ_ПлановыеРемонты.ID = торо_ПланГрафикРемонтаПланРемонтов.ID
	        |			И ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот = торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот
	        |ГДЕ
	        |	торо_ПланГрафикРемонтаПланРемонтов.ДатаКон <= &ДатаКон
	        |	И торо_ПланГрафикРемонтаПланРемонтов.ДатаНач >= &ДатаНач
	        |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Замещен
	        |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Отменен
	        |	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ЗакрытиеЗаявокИРемонтов
	        |	%ОбъектРемонта
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот,
	        |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПлановыеРаботыСКоличеством.ВидРемонтныхРабот КАК ВидРемонтныхРабот
	        |ПОМЕСТИТЬ ВТ_ВидыРемРабот
	        |ИЗ
	        |	ВТ_ПлановыеРаботыСКоличеством КАК ВТ_ПлановыеРаботыСКоличеством
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ПлановыеРаботыСКоличеством.ВидРемонтныхРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПлановыеРаботыСКоличеством.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот
	        |ПОМЕСТИТЬ ВТ_ОбъектыРемонта
	        |ИЗ
	        |	ВТ_ПлановыеРаботыСКоличеством КАК ВТ_ПлановыеРаботыСКоличеством
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ПлановыеРаботыСКоличеством.ОбъектРемонтныхРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ОбъектыРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	        |	ВТ_ВидыРемРабот.ВидРемонтныхРабот КАК ВидРемонтныхРабот
	        |ПОМЕСТИТЬ ВТ_Подготовительная
	        |ИЗ
	        |	ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта,
	        |	ВТ_ВидыРемРабот КАК ВТ_ВидыРемРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ВидыРемРабот.ВидРемонтныхРабот КАК ВидРемонтныхРабот
	        |ИЗ
	        |	ВТ_ВидыРемРабот КАК ВТ_ВидыРемРабот
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ВидРемонтныхРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Подготовительная.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
			|	ПРЕДСТАВЛЕНИЕ(ВТ_Подготовительная.ОбъектРемонтныхРабот) КАК ОбъектРемонта,
	        |	ВТ_Подготовительная.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	        |	ЕСТЬNULL(ВТ_ПлановыеРаботыСКоличеством.Количество, 0) КАК Количество,
	        |	ЕСТЬNULL(торо_ОбъектыРемонта.ИнвентарныйНомер, """") КАК ИнвНомер,
	        |	ЕСТЬNULL(торо_ОбъектыРемонта.ЗаводскойНомер, """") КАК ЗаводскойНомерОР,
	        |	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Марка, """") КАК МаркаОР
	        |ИЗ
	        |	ВТ_Подготовительная КАК ВТ_Подготовительная
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеРаботыСКоличеством КАК ВТ_ПлановыеРаботыСКоличеством
	        |		ПО ВТ_Подготовительная.ОбъектРемонтныхРабот = ВТ_ПлановыеРаботыСКоличеством.ОбъектРемонтныхРабот
	        |			И ВТ_Подготовительная.ВидРемонтныхРабот = ВТ_ПлановыеРаботыСКоличеством.ВидРемонтныхРабот
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	        |		ПО ВТ_Подготовительная.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ОбъектРемонтныхРабот,
	        |	ВидРемонтныхРабот
	        |ИТОГИ
	        |	МАКСИМУМ(ИнвНомер),
	        |	МАКСИМУМ(ЗаводскойНомерОР),
	        |	МАКСИМУМ(МаркаОР)
	        |ПО
	        |	ОбъектРемонтныхРабот";
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Текст = СтрЗаменить(Текст, "%ОбъектРемонта", "И ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот = &ОбъектРемонтныхРабот");
	Иначе
		Текст = СтрЗаменить(Текст, "%ОбъектРемонта", "");
	КонецЕсли;
	
	Возврат Текст;

КонецФункции 

&НаСервере
Функция ПолучитьТекстЗапросаМесячныйГрафикППРиТО()

	Текст = "ВЫБРАТЬ
	        |	ДанныеПроизводственногоКалендаря.Дата КАК Дата
	        |ПОМЕСТИТЬ ВТ_ДатыЗаПериод
	        |ИЗ
	        |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	        |ГДЕ
	        |	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаКон
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	торо_ПланГрафикРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	        |	торо_ПланГрафикРемонта.ID КАК ID,
	        |	торо_ПланГрафикРемонта.Регистратор КАК Регистратор,
	        |	торо_ПланГрафикРемонта.Период КАК Период
	        |ПОМЕСТИТЬ ВТ_ПлановыеРемонты
	        |ИЗ
	        |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(, Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта) КАК торо_ПланГрафикРемонта
	        |ГДЕ
	        |	торо_ПланГрафикРемонта.Отменен = ЛОЖЬ
	        |	И торо_ПланГрафикРемонта.Замещен = ЛОЖЬ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	        |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	        |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач КАК ДатаПланируемогоРемонта
	        |ПОМЕСТИТЬ ВТ_ПлановыеРаботыСДатами
	        |ИЗ
	        |	ВТ_ПлановыеРемонты КАК ВТ_ПлановыеРемонты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	        |			ПО (торо_АктуальныеПлановыеДатыРемонтов.IDРемонта = торо_ПланГрафикРемонтаПланРемонтов.ID)
	        |		ПО ВТ_ПлановыеРемонты.Регистратор = торо_ПланГрафикРемонтаПланРемонтов.Ссылка
	        |			И ВТ_ПлановыеРемонты.ID = торо_ПланГрафикРемонтаПланРемонтов.ID
	        |			И ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот = торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот
	        |ГДЕ
	        |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНач МЕЖДУ &ДатаНач И &ДатаКон
	        |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Замещен
	        |	И НЕ торо_ПланГрафикРемонтаПланРемонтов.Отменен
	        |	И НЕ торо_АктуальныеПлановыеДатыРемонтов.ДокументОснование ССЫЛКА Документ.торо_ЗакрытиеЗаявокИРемонтов
	        |	%ОбъектРемонта
	        |	%ВидРемонтныхРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ПлановыеРаботыСДатами.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот
	        |ПОМЕСТИТЬ ВТ_ОбъектыРемонта
	        |ИЗ
	        |	ВТ_ПлановыеРаботыСДатами КАК ВТ_ПлановыеРаботыСДатами
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ПлановыеРаботыСДатами.ОбъектРемонтныхРабот
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ОбъектыРемонта.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	        |	ВТ_ДатыЗаПериод.Дата КАК Дата
	        |ПОМЕСТИТЬ ВТ_Предварительная
	        |ИЗ
	        |	ВТ_ДатыЗаПериод КАК ВТ_ДатыЗаПериод,
	        |	ВТ_ОбъектыРемонта КАК ВТ_ОбъектыРемонта
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ДатыЗаПериод.Дата КАК Дата
	        |ИЗ
	        |	ВТ_ДатыЗаПериод КАК ВТ_ДатыЗаПериод
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Предварительная.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
			|	ПРЕДСТАВЛЕНИЕ(ВТ_Предварительная.ОбъектРемонтныхРабот) КАК ОбъектРемонта,
	        |	ВТ_Предварительная.Дата КАК Дата,
	        |	ЕСТЬNULL(ВТ_ПлановыеРаботыСДатами.ВидРемонтныхРабот, ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)) КАК ВидРемонтныхРабот,
	        |	ЕСТЬNULL(торо_ОбъектыРемонта.ИнвентарныйНомер, """") КАК ИнвНомер,
	        |	ЕСТЬNULL(торо_ОбъектыРемонта.ЗаводскойНомер, """") КАК ЗаводскойНомерОР,
	        |	ЕСТЬNULL(торо_ОбъектыРемонта.проф_Марка, """") КАК МаркаОР
	        |ИЗ
	        |	ВТ_Предварительная КАК ВТ_Предварительная
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлановыеРаботыСДатами КАК ВТ_ПлановыеРаботыСДатами
	        |		ПО ВТ_Предварительная.ОбъектРемонтныхРабот = ВТ_ПлановыеРаботыСДатами.ОбъектРемонтныхРабот
	        |			И ВТ_Предварительная.Дата = ВТ_ПлановыеРаботыСДатами.ДатаПланируемогоРемонта
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	        |		ПО ВТ_Предварительная.ОбъектРемонтныхРабот = торо_ОбъектыРемонта.Ссылка
	        |ИТОГИ
	        |	МАКСИМУМ(ИнвНомер),
	        |	МАКСИМУМ(ЗаводскойНомерОР),
	        |	МАКСИМУМ(МаркаОР)
	        |ПО
	        |	ОбъектРемонтныхРабот";
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Текст = СтрЗаменить(Текст, "%ОбъектРемонта", "И ВТ_ПлановыеРемонты.ОбъектРемонтныхРабот = &ОбъектРемонтныхРабот");
	Иначе
		Текст = СтрЗаменить(Текст, "%ОбъектРемонта", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидРемонта) Тогда
		Текст = СтрЗаменить(Текст, "%ВидРемонтныхРабот", "И торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот = &ВидРемонтныхРабот");
	Иначе
		Текст = СтрЗаменить(Текст, "%ВидРемонтныхРабот", "");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

//-- Проф-ИТ, #83, Иванова Е.С., 25.09.2023

#КонецОбласти
